# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    progressbar.sh                                     :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: fvoicu <fvoicu@student.42heilbronn.de>     +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2023/10/15 22:22:53 by fvoicu            #+#    #+#              #
#    Updated: 2023/10/16 01:58:36 by fvoicu           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

printf "\033[38;5;6m"
echo -ne '🌊                  \r'
sleep 0.1
echo -ne '🌊🌊                \r'
sleep 0.1
echo -ne '🌊🌊🌊              \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊            \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊          \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊🌊        \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊🌊🌊      \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊🌊🌊🌊    \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊🌊🌊🌊🌊  \r'
sleep 0.1
echo -ne '🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊\r'
sleep 0.1
echo -ne '\n'